# 1)

# Flowchart არის დიაგრამა, რომელიც ვიზუალურად აჩვენებს პროცესის ნაბიჯებს.
# მაგალითად, პურის გამოცხობა სამზარეულოში: დაწყება -> ინგრედიენტების მომზადება -> ცომის მოზელა -> გამოცხობა.

# Sequencing ნიშნავს, რომ ბრძანებები შესრულდება რიგრიგობით, ერთი მეორის შემდეგ.
print("Hello")        # პირველი ნაბიჯი
print("How are you?") # მეორე ნაბიჯი
print("Welcome!")     # მესამე ნაბიჯი

# Iteration არის, როცა ერთი და იგივე მოქმედება მეორდება რამდენიმე ჯერ.
for i in range(5):
    print("Hello")    # დაბეჭდვა 5–ჯერ

# Selection არის, როცა პროგრამა რაღაც პირობას ამოწმებს და რომელიმე გზას ირჩევს რომლებიც უკვე დაწერილია.
age = 16
if age >= 18:
    print("You can vote")       # პირობა შესრულდა
else:
    print("You are too young to vote")  # პირობა არ შესრულდა    