# კომენტარის დასაწერად გამოიყენება სიმბოლო "#" მისი მეშვეობით პროგრამა ამ აზს აიგნორებს. ეს არის შექმნილი ადამიანებისთვის როდესაც 1ზე მეტი მუშაობს ან რამდენიმე დღე გიწევს კოდის წერა, რომ დაუტოვო სად გაცერდი და რეები გააკეთთე ან რა დაგრჩა გასაკეთებელი
# case-sensitive არის ზოგიერთი პროგრამა. თუ პროგრამა არის ასეთი მაშნ გააჩნია დიდ ასოს დაწერ თუ პატარას.
# snake case გამოიყენება როდესაც ცვლადის გაკეთების დროს ორ ან მეტსიტყვინ რამეს აკეთებ და გინდა რომ დაყოფა იყოს space არ იმუშავებს ამიტომ გამოიყენება "_"
# bug ქვია პროცესს როდესაც პროგრამა კარგად არ მუშობს
# debugging არის პროცესი როდესაც ადამიანი ცდილობს კოდის გამოსწორებას

print("hello world")
city="London"
print("city")

